In [1]:
import pandas as pd

In [2]:
fb = pd.read_csv("../predictions/finbert_underfit_for_sake_of_research.csv")

In [3]:
m1 = pd.read_csv("../predictions/t2_mrm8488.csv")

In [4]:
m2 = pd.read_csv("../predictions/t2_mrm8488_v2.csv")

In [7]:
m1[(m1.start == m2.start) & (m1.end == m2.end)]

        id  start  end
0        0      0   76
1        1      0   85
2        2      0  154
3        3      0   42
4        4      0  101
...    ...    ...  ...
9995  9995      1   34
9996  9996      1   76
9997  9997      0  154
9998  9998      0   75
9999  9999      1  109

[10000 rows x 3 columns]

In [8]:
m1

        id  start  end
0        0      0   76
1        1      0   85
2        2      0  154
3        3      0   42
4        4      0  101
...    ...    ...  ...
9995  9995      1   34
9996  9996      1   76
9997  9997      0  154
9998  9998      0   75
9999  9999      1  109

[10000 rows x 3 columns]

In [9]:
m2

        id  start  end
0        0      0   76
1        1      0   85
2        2      0  154
3        3      0   42
4        4      0  101
...    ...    ...  ...
9995  9995      1   34
9996  9996      1   76
9997  9997      0  154
9998  9998      0   75
9999  9999      1  109

[10000 rows x 3 columns]

In [10]:
fb[(fb.start == m2.start) & (fb.end == m2.end)]

        id  start  end
104    104      0   27
737    737      0   22
1257  1257      0    8
2170  2170      0   10
2271  2271      0    0
2273  2273      0    0
2396  2396      0   16
2452  2452      0   26
2466  2466      0   20
2799  2799      0   28
3080  3080      0   20
3188  3188      0   19
4184  4184      0   33
4274  4274      0   18
4658  4658      0    0
5518  5518      0    7
5966  5966      0   20
6585  6585      0    8
6587  6587      0    3
6862  6862      0    0
7077  7077      0    0
7780  7780      0    0
8125  8125      0   26
9293  9293      0   15
9760  9760      0    9
9761  9761      0   12

In [13]:
rb = pd.read_csv("../predictions/t2_roberta_tokenizer.csv")

In [15]:
fb[(fb.start == rb.start) & (fb.end != rb.end)]

        id  start  end
17      17      0    0
24      24      0   24
36      36     22   59
40      40     25   60
55      55      0   52
...    ...    ...  ...
9931  9931      9   49
9932  9932      0   16
9943  9943     23   73
9977  9977     26   47
9998  9998     17   41

[754 rows x 3 columns]

In [16]:
fb[(fb.start != rb.start) & (fb.end == rb.end)]

        id  start  end
5        5     35   67
22      22     33   68
91      91      2   64
108    108     16   28
155    155      2   31
...    ...    ...  ...
9894  9894      0   32
9916  9916      5   15
9936  9936     29   82
9939  9939     14   57
9941  9941     14   57

[365 rows x 3 columns]